MRF_single_rotor/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"

    inflow
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

	outflow
	{
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
	}

	sidee
	{
		type			symmetry;
	}

	blade
	{
		type			epsilonWallFunction;
		value			$internalField;
	}

}


// ************************************************************************* //
