MRF_single_rotor/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.6;

boundaryField
{

    inflow
    {
        type            turbulentIntensityKineticEnergyInlet;
		intensity		0.05;		// 5% turbulence
		value			uniform 1;	// placeholder	
    }
	
	outflow
	{
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
	}
	
	sidee
	{
		type			symmetry;
	}
	
	blade
	{
        type            kqRWallFunction;
        value           $internalField;
	}
	
    }


// ************************************************************************* //
