MRF_single_rotor/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
	//inlet
    {
        name            inflow;
        patchInfo
        {
            type            patch;
            matchTolerance  0.0001;
        }
        constructFrom patches;
        patches (inlet);
    }
	
	//side
    {
        // create symmetry side
        name            sidee;
        patchInfo
        {
            type            symmetry;
            matchTolerance  0.0001;
        }
        constructFrom patches;
        patches (side);
    }

	//outlet
    {
        // create combined outflow
        name            outflow;
        patchInfo
        {
            type            patch;
            matchTolerance  0.0001;
        }
        constructFrom patches;
        patches (outlet);
    }

);

// ************************************************************************* //