MRF_single_rotor/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  30;

method              scotch;

simpleCoeffs
{
    n               (1 30 1); // total must match numberOfSubdomains
}

hierarchicalCoeffs
{
    n               (1 30 1); // total must match numberOfSubdomains
    order           xyz;
}


// ************************************************************************* //
