MRF_single_rotor/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
	default			Gauss linear;
}

divSchemes
{
	default								none;
    div(phi,U)      bounded Gauss linearUpwind unlimited;
    div(phi,k)      bounded Gauss linearUpwind limited 1;
    div(phi,epsilon) bounded Gauss linearUpwind limited 1;
	div((nuEff*dev2(T(grad(U))))) 		Gauss linear;
}

laplacianSchemes
{
	default			Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

wallDist
{
	method			meshWave;
	nRequired		false;
}


// ************************************************************************* //
