MRF_single_rotor/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver					GAMG;
        tolerance       		1e-5;
        relTol          		0.05;
		smoother				GaussSeidel;
		nCellsInCoarsestLevel	1400;
		cacheAgglomeration		true;
		agglomerator			faceAreaPair;
		mergeLevels				1;
    }

     "(U|k|epsilon)"
    {
        solver			smoothSolver;
		smoother		GaussSeidel;
		nSweeps			2;
		tolerance		1e-5;
		relTol			0.1;
    }
	
}

SIMPLE
{
    nNonOrthogonalCorrectors 	0;
	pRefCell					0;
	pRefValue					0;
	residualControl
	{
		p						1e-6;
		U						1e-6;
		"(k|epsilon)"			1e-6;
	}
}

relaxationFactors
{
	fields
	{
		p			0.5;
	}
	equations
	{
		U			0.3;
		k			0.3;
		epsilon			0.3;
	}
}

// ************************************************************************* //
